app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "address", "number", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @client = Client.new(client_params)

    if @client.save

UPDATE "clients" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "Updated Name"], ["email", "updated@example.com"], ["updated_at", "2024-01-15 18:26:09.629342"], ["id", 980190962]]
---
  def update
    if @client.update(client_params)

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 980190962]]
---
  def destroy
    @client.destroy