app/controllers/employees_controller.rb

   def create
     @employee = Employee.new(employee_params)

     if @employee.save
---
INSERT INTO "employees" ("name", "phone_number", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

   def update
     if @employee.update(employee_params)
---
UPDATE "employees" SET "name" = ?, "phone_number" = ?, "address" = ?, "email" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Updated Name"], ["phone_number", "987654321"], ["address", "Updated Addres"], ["email", "updatedEmployee@example.com"], ["updated_at", "2024-01-20 21:38:50.599905"], ["id", 989355118]]