back-end/app/controllers/users/sessions_controller.rb

  def create
    user = User.find_for_authentication(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "test@test.com"], ["LIMIT", 1]]