back-end/app/controllers/invoices_controller.rb

  def index
    byebug
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"

  def create
    @invoice = Invoice.new(invoice_params)

    if @invoice.save
---
INSERT INTO "invoices" ("amount_due", "due_date", "payment_status", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["amount_due", 100.0], ["due_date", "2024-03-01"], ["payment_status", 0], ["client_id", 1], ["created_at", "2024-03-07 21:41:52.978604"], ["updated_at", "2024-03-07 21:41:52.978604"]]

  def update
    if @invoice.update(invoice_params)
---
UPDATE "invoices" SET "amount_due" = ?, "due_date" = ?, "payment_status" = ?, "client_id" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["amount_due", 200.0], ["due_date", "2024-04-04"], ["payment_status", 1], ["client_id", 2], ["updated_at", "2024-03-07 21:34:14.381300"], ["id", 461847090]]

  def destroy
    @invoice.destroy
---
DELETE FROM "invoices" WHERE "invoices"."id" = ?  [["id", 461847090]]

  def set_invoice
    @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 461847090], ["LIMIT", 1]]